IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/VIM_VIM.xml
<module name="VIM_VIM" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="VIM_PID" acronym="VIM_PID" offset="0x0" width="32" description="">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="PID register scheme" range="31 - 30" rwaccess="RO"/> 
		<bitfield id="BU" width="2" begin="29" end="28" resetval="0x2" description="Business Unit: 10 = Processors" range="29 - 28" rwaccess="RO"/> 
		<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x144" description="Module ID" range="27 - 16" rwaccess="RO"/> 
		<bitfield id="RTL" width="5" begin="15" end="11" resetval="0x0" description="RTL revision. Will vary depending on release." range="15 - 11" rwaccess="RO"/> 
		<bitfield id="MAJOR" width="3" begin="10" end="8" resetval="0x0" description="Major revision" range="10 - 8" rwaccess="RO"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Custom" range="7 - 6" rwaccess="RO"/> 
		<bitfield id="MINOR" width="6" begin="5" end="0" resetval="0x1" description="Minor revision" range="5 - 0" rwaccess="RO"/>
	</register>
	<register id="VIM_INFO" acronym="VIM_INFO" offset="0x4" width="32" description="">
		<bitfield id="RES1" width="21" begin="31" end="11" resetval="0x0" description="RESERVE FIELD" range="31 - 11" rwaccess="RO"/> 
		<bitfield id="INTERRUPTS" width="11" begin="10" end="0" resetval="0x256" description="Total number of Interrupts" range="10 - 0" rwaccess="RO"/>
	</register>
	<register id="VIM_PRIIRQ" acronym="VIM_PRIIRQ" offset="0x8" width="32" description="">
		<bitfield id="VALID" width="1" begin="31" end="31" resetval="0x0" description="Indicates that the num field is valid." range="31" rwaccess="RO"/> 
		<bitfield id="RES2" width="11" begin="30" end="20" resetval="0x0" description="RESERVE FIELD" range="30 - 20" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="19" end="16" resetval="0x0" description="Priority of the highest priority pending IRQ.  valid only if  the valid flag is set." range="19 - 16" rwaccess="RO"/> 
		<bitfield id="RES3" width="6" begin="15" end="10" resetval="0x0" description="RESERVE FIELD" range="15 - 10" rwaccess="RO"/> 
		<bitfield id="NUM" width="10" begin="9" end="0" resetval="0x0" description="Number of the highest priority pending IRQ.  valid only if  the valid flag is set." range="9 - 0" rwaccess="RO"/>
	</register>
	<register id="VIM_PRIFIQ" acronym="VIM_PRIFIQ" offset="0xC" width="32" description="">
		<bitfield id="VALID" width="1" begin="31" end="31" resetval="0x0" description="Indicates that the num field is valid." range="31" rwaccess="RO"/> 
		<bitfield id="RES4" width="11" begin="30" end="20" resetval="0x0" description="RESERVE FIELD" range="30 - 20" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="19" end="16" resetval="0x0" description="Priority of the highest priority pending FIQ.  valid only if  the valid flag is set." range="19 - 16" rwaccess="RO"/> 
		<bitfield id="RES5" width="6" begin="15" end="10" resetval="0x0" description="RESERVE FIELD" range="15 - 10" rwaccess="RO"/> 
		<bitfield id="NUM" width="10" begin="9" end="0" resetval="0x0" description="Number of the highest priority pending FIQ.  valid only if  the valid flag is set." range="9 - 0" rwaccess="RO"/>
	</register>
	<register id="VIM_IRQGSTS" acronym="VIM_IRQGSTS" offset="0x10" width="32" description="">
		<bitfield id="STS" width="32" begin="31" end="0" resetval="0x0" description="Indicates that the num field is valid." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="VIM_FIQGSTS" acronym="VIM_FIQGSTS" offset="0x14" width="32" description="">
		<bitfield id="STS" width="32" begin="31" end="0" resetval="0x0" description="Indicates that the num field is valid." range="31 - 0" rwaccess="RO"/>
	</register>
	<register id="VIM_IRQVEC" acronym="VIM_IRQVEC" offset="0x18" width="32" description="">
		<bitfield id="ADDR" width="30" begin="31" end="2" resetval="0x0" description="Upper 30 bits of the 32-bit vector address.  Only valid if  the Prioritized IRQ Register valid flag is true." range="31 - 2" rwaccess="RW"/> 
		<bitfield id="RES21" width="2" begin="1" end="0" resetval="0x0" description="RESERVE FIELD" range="1 - 0" rwaccess="RO"/>
	</register>
	<register id="VIM_FIQVEC" acronym="VIM_FIQVEC" offset="0x1C" width="32" description="">
		<bitfield id="ADDR" width="30" begin="31" end="2" resetval="0x0" description="Upper 30 bits of the 32-bit vector address.  Only valid if  the Prioritized FIQ Register valid flag is true." range="31 - 2" rwaccess="RW"/> 
		<bitfield id="RES22" width="2" begin="1" end="0" resetval="0x0" description="RESERVE FIELD" range="1 - 0" rwaccess="RO"/>
	</register>
	<register id="VIM_ACTIRQ" acronym="VIM_ACTIRQ" offset="0x20" width="32" description="">
		<bitfield id="VALID" width="1" begin="31" end="31" resetval="0x0" description="Indicates that the num field is valid. Set when the IRQ  Vector Address Register is read and cleared whenever the IRQ  Vector Address Register is written." range="31" rwaccess="RO"/> 
		<bitfield id="RES6" width="11" begin="30" end="20" resetval="0x0" description="RESERVE FIELD" range="30 - 20" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="19" end="16" resetval="0x0" description="Priority of the highest priority pending IRQ.  valid only if  the valid flag is set." range="19 - 16" rwaccess="RO"/> 
		<bitfield id="RES7" width="6" begin="15" end="10" resetval="0x0" description="RESERVE FIELD" range="15 - 10" rwaccess="RO"/> 
		<bitfield id="NUM" width="10" begin="9" end="0" resetval="0x0" description="Number of the currently active IRQ. Loaded from teh  Prioritized IRQ Register whenever the IRQ Vector Address is  read. Valid only if the valid flag is set." range="9 - 0" rwaccess="RO"/>
	</register>
	<register id="VIM_ACTFIQ" acronym="VIM_ACTFIQ" offset="0x24" width="32" description="">
		<bitfield id="VALID" width="1" begin="31" end="31" resetval="0x0" description="Indicates that the num field is valid. Set when the FIQ  Vector Address Register is read and cleared whenever the FIQ  Vector Address Register is written." range="31" rwaccess="RO"/> 
		<bitfield id="RES8" width="11" begin="30" end="20" resetval="0x0" description="RESERVE FIELD" range="30 - 20" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="19" end="16" resetval="0x0" description="Priority of the highest priority pending IRQ.  valid only if  the valid flag is set." range="19 - 16" rwaccess="RO"/> 
		<bitfield id="RES9" width="6" begin="15" end="10" resetval="0x0" description="RESERVE FIELD" range="15 - 10" rwaccess="RO"/> 
		<bitfield id="NUM" width="10" begin="9" end="0" resetval="0x0" description="Number of the currently active FIQ. Loaded from teh  Prioritized FIQ Register whenever the FIQ Vector Address is  read. Valid only if the valid flag is set." range="9 - 0" rwaccess="RO"/>
	</register>
	<register id="VIM_IRQPRIMSK" acronym="VIM_IRQPRIMSK" offset="0x28" width="32" description="">
		<bitfield id="RES24" width="16" begin="31" end="16" resetval="0x0" description="RESERVE FIELD" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="MSK" width="16" begin="15" end="0" resetval="0x65535" description="Each bit corresponds to the given priority.  1 - IRQs of this priority are enabled. 0 - IRQs of this priority are disabled." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_FIQPRIMSK" acronym="VIM_FIQPRIMSK" offset="0x2C" width="32" description="">
		<bitfield id="RES24" width="16" begin="31" end="16" resetval="0x0" description="RESERVE FIELD" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="MSK" width="16" begin="15" end="0" resetval="0x65535" description="Each bit corresponds to the given priority.  1 - FIQs of this priority are enabled. 0 - FIQs of this priority are disabled." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_DEDVEC" acronym="VIM_DEDVEC" offset="0x30" width="32" description="">
		<bitfield id="ADDR" width="30" begin="31" end="2" resetval="0x0" description="Upper 30 bits of the 32-bit vector address." range="31 - 2" rwaccess="RW"/> 
		<bitfield id="RES23" width="2" begin="1" end="0" resetval="0x0" description="RESERVE FIELD" range="1 - 0" rwaccess="RO"/>
	</register>
	<register id="VIM_RAW" acronym="VIM_RAW" offset="0x400" width="32" description="">
		<bitfield id="STS" width="32" begin="31" end="0" resetval="0x0" description="This is the raw status of the events in Group M Each bit corresponds to event Q where Q = Mx32+Bit Read 0  InactiveRead 1  Active/PendingWrite 0  No effectWrite 1  Set to Interrupt Raw Status" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_STS" acronym="VIM_STS" offset="0x404" width="32" description="">
		<bitfield id="MASK" width="32" begin="31" end="0" resetval="0x0" description="This is the masked status of the events in Group M  Each bit corresponds to event Q where Q = Mx32+Bit Read 0  Inactive or DisabledRead 1  Active/Pending and EnabledWrite  0 No effectWrite 1 Clear Interrupt Raw Status" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTR_EN_SET" acronym="VIM_INTR_EN_SET" offset="0x408" width="32" description="">
		<bitfield id="MASK" width="32" begin="31" end="0" resetval="0x0" description="This field is used to enable the mask of events in Group M  Each bit corresponds to event Q where Q = Mx32+BitRead 0 DisabledRead 1 EnabledWrite  0 No effectWrite  1 Set Enable" range="31 - 0" rwaccess="RW"/>
	</register>
