IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/VIM_VIM.xml
	<register id="VIM_INTER_EN_CLR" acronym="VIM_INTER_EN_CLR" offset="0x40C" width="32" description="">
		<bitfield id="MASK" width="32" begin="31" end="0" resetval="0x0" description="This field is used to disable the mask of events in Group M Each bit corresponds to event Q where Q = Mx32+BitRead 0 DisabledRead 1 EnabledWrite 0 No effectWrite 1 Clear Enable" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_IRQSTS" acronym="VIM_IRQSTS" offset="0x410" width="32" description="">
		<bitfield id="MASK" width="32" begin="31" end="0" resetval="0x0" description="This is the masked status of the events in group M that are mapped to IRQ  Each bit corresponds to event Q where Q = Mx32+BitRead 0 Inactive, Disabled, or not an IRQRead 1 Active/Pending, Enabled, and IRQWrite  0 No effectWrite  1 Clear Interrupt Raw Status (if IRQ)" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_FIQSTS" acronym="VIM_FIQSTS" offset="0x414" width="32" description="">
		<bitfield id="MASK" width="32" begin="31" end="0" resetval="0x0" description="This is the masked status of the events in group M that are mapped to FIQ  Each bit corresponds to event Q where Q = Mx32+BitRead 0 Inactive, Disabled, or not an FIQRead 1 Active/Pending, Enabled, and FIQWrite  0 No effectWrite  1 Clear Interrupt Raw Status (if FIQ)" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTMAP" acronym="VIM_INTMAP" offset="0x418" width="32" description="">
		<bitfield id="MASK" width="32" begin="31" end="0" resetval="0x0" description="This field is used to indicate which interrupt the corresponding event influences (if enabled) for event group M.  Each bit corresponds to event Q where Q = Mx32+Bit   0 IRQ Interrupt (default)1 FIQ Interrupt" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTTYPE" acronym="VIM_INTTYPE" offset="0x41C" width="32" description="">
		<bitfield id="VAL" width="32" begin="31" end="0" resetval="0x0" description="This field is used to indicate whether the source of an interrupt is a level (default) or a pulse for event group M.  This is informational so that an ISR may query this register and know whether it has to clear a pulse event or a level event (see 3.4 Interrupt Handling).  The value has no effect on how the VIM hardware functions.  The input interrupts are agnostic as to whether they are pulse or level.  Each bit corresponds to event Q where Q = Mx32+Bit0  Level (default)1  Pulse" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_RAW_1" acronym="VIM_RAW_1" offset="0x420" width="32" description="">
		<bitfield id="STS" width="32" begin="31" end="0" resetval="0x0" description="This is the raw status of the events in Group M Each bit corresponds to event Q where Q = Mx32+Bit Read 0  InactiveRead 1  Active/PendingWrite 0  No effectWrite 1  Set to Interrupt Raw Status" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_STS_1" acronym="VIM_STS_1" offset="0x424" width="32" description="">
		<bitfield id="MASK" width="32" begin="31" end="0" resetval="0x0" description="This is the masked status of the events in Group M  Each bit corresponds to event Q where Q = Mx32+Bit Read 0  Inactive or DisabledRead 1  Active/Pending and EnabledWrite  0 No effectWrite 1 Clear Interrupt Raw Status" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTR_EN_SET_1" acronym="VIM_INTR_EN_SET_1" offset="0x428" width="32" description="">
		<bitfield id="MASK" width="32" begin="31" end="0" resetval="0x0" description="This field is used to enable the mask of events in Group M  Each bit corresponds to event Q where Q = Mx32+BitRead 0 DisabledRead 1 EnabledWrite  0 No effectWrite  1 Set Enable" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTER_EN_CLR_1" acronym="VIM_INTER_EN_CLR_1" offset="0x42C" width="32" description="">
		<bitfield id="MASK" width="32" begin="31" end="0" resetval="0x0" description="This field is used to disable the mask of events in Group M Each bit corresponds to event Q where Q = Mx32+BitRead 0 DisabledRead 1 EnabledWrite 0 No effectWrite 1 Clear Enable" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_IRQSTS_1" acronym="VIM_IRQSTS_1" offset="0x430" width="32" description="">
		<bitfield id="MASK" width="32" begin="31" end="0" resetval="0x0" description="This is the masked status of the events in group M that are mapped to IRQ  Each bit corresponds to event Q where Q = Mx32+BitRead 0 Inactive, Disabled, or not an IRQRead 1 Active/Pending, Enabled, and IRQWrite  0 No effectWrite  1 Clear Interrupt Raw Status (if IRQ)" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_FIQSTS_1" acronym="VIM_FIQSTS_1" offset="0x434" width="32" description="">
		<bitfield id="MASK" width="32" begin="31" end="0" resetval="0x0" description="This is the masked status of the events in group M that are mapped to FIQ  Each bit corresponds to event Q where Q = Mx32+BitRead 0 Inactive, Disabled, or not an FIQRead 1 Active/Pending, Enabled, and FIQWrite  0 No effectWrite  1 Clear Interrupt Raw Status (if FIQ)" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTMAP_1" acronym="VIM_INTMAP_1" offset="0x438" width="32" description="">
		<bitfield id="MASK" width="32" begin="31" end="0" resetval="0x0" description="This field is used to indicate which interrupt the corresponding event influences (if enabled) for event group M.  Each bit corresponds to event Q where Q = Mx32+Bit   0 IRQ Interrupt (default)1 FIQ Interrupt" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTTYPE_1" acronym="VIM_INTTYPE_1" offset="0x43C" width="32" description="">
		<bitfield id="VAL" width="32" begin="31" end="0" resetval="0x0" description="This field is used to indicate whether the source of an interrupt is a level (default) or a pulse for event group M.  This is informational so that an ISR may query this register and know whether it has to clear a pulse event or a level event (see 3.4 Interrupt Handling).  The value has no effect on how the VIM hardware functions.  The input interrupts are agnostic as to whether they are pulse or level.  Each bit corresponds to event Q where Q = Mx32+Bit0  Level (default)1  Pulse" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_RAW_2" acronym="VIM_RAW_2" offset="0x440" width="32" description="">
		<bitfield id="STS" width="32" begin="31" end="0" resetval="0x0" description="This is the raw status of the events in Group M Each bit corresponds to event Q where Q = Mx32+Bit Read 0  InactiveRead 1  Active/PendingWrite 0  No effectWrite 1  Set to Interrupt Raw Status" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_STS_2" acronym="VIM_STS_2" offset="0x444" width="32" description="">
		<bitfield id="MASK" width="32" begin="31" end="0" resetval="0x0" description="This is the masked status of the events in Group M  Each bit corresponds to event Q where Q = Mx32+Bit Read 0  Inactive or DisabledRead 1  Active/Pending and EnabledWrite  0 No effectWrite 1 Clear Interrupt Raw Status" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTR_EN_SET_2" acronym="VIM_INTR_EN_SET_2" offset="0x448" width="32" description="">
		<bitfield id="MASK" width="32" begin="31" end="0" resetval="0x0" description="This field is used to enable the mask of events in Group M  Each bit corresponds to event Q where Q = Mx32+BitRead 0 DisabledRead 1 EnabledWrite  0 No effectWrite  1 Set Enable" range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTER_EN_CLR_2" acronym="VIM_INTER_EN_CLR_2" offset="0x44C" width="32" description="">
		<bitfield id="MASK" width="32" begin="31" end="0" resetval="0x0" description="This field is used to disable the mask of events in Group M Each bit corresponds to event Q where Q = Mx32+BitRead 0 DisabledRead 1 EnabledWrite 0 No effectWrite 1 Clear Enable" range="31 - 0" rwaccess="RW"/>
	</register>
