IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/VIM_VIM.xml
	<register id="VIM_INTPRIORITY_31" acronym="VIM_INTPRIORITY_31" offset="0x107C" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_32" acronym="VIM_INTPRIORITY_32" offset="0x1080" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_33" acronym="VIM_INTPRIORITY_33" offset="0x1084" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_34" acronym="VIM_INTPRIORITY_34" offset="0x1088" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_35" acronym="VIM_INTPRIORITY_35" offset="0x108C" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_36" acronym="VIM_INTPRIORITY_36" offset="0x1090" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_37" acronym="VIM_INTPRIORITY_37" offset="0x1094" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_38" acronym="VIM_INTPRIORITY_38" offset="0x1098" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_39" acronym="VIM_INTPRIORITY_39" offset="0x109C" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_40" acronym="VIM_INTPRIORITY_40" offset="0x10A0" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_41" acronym="VIM_INTPRIORITY_41" offset="0x10A4" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_42" acronym="VIM_INTPRIORITY_42" offset="0x10A8" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_43" acronym="VIM_INTPRIORITY_43" offset="0x10AC" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
