IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/VIM_VIM.xml
	<register id="VIM_INTPRIORITY_115" acronym="VIM_INTPRIORITY_115" offset="0x11CC" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_116" acronym="VIM_INTPRIORITY_116" offset="0x11D0" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_117" acronym="VIM_INTPRIORITY_117" offset="0x11D4" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_118" acronym="VIM_INTPRIORITY_118" offset="0x11D8" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_119" acronym="VIM_INTPRIORITY_119" offset="0x11DC" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_120" acronym="VIM_INTPRIORITY_120" offset="0x11E0" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_121" acronym="VIM_INTPRIORITY_121" offset="0x11E4" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_122" acronym="VIM_INTPRIORITY_122" offset="0x11E8" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_123" acronym="VIM_INTPRIORITY_123" offset="0x11EC" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_124" acronym="VIM_INTPRIORITY_124" offset="0x11F0" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_125" acronym="VIM_INTPRIORITY_125" offset="0x11F4" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_126" acronym="VIM_INTPRIORITY_126" offset="0x11F8" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
