IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/VIM_VIM.xml
	<register id="VIM_INTPRIORITY_127" acronym="VIM_INTPRIORITY_127" offset="0x11FC" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_128" acronym="VIM_INTPRIORITY_128" offset="0x1200" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_129" acronym="VIM_INTPRIORITY_129" offset="0x1204" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_130" acronym="VIM_INTPRIORITY_130" offset="0x1208" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_131" acronym="VIM_INTPRIORITY_131" offset="0x120C" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_132" acronym="VIM_INTPRIORITY_132" offset="0x1210" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_133" acronym="VIM_INTPRIORITY_133" offset="0x1214" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_134" acronym="VIM_INTPRIORITY_134" offset="0x1218" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_135" acronym="VIM_INTPRIORITY_135" offset="0x121C" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_136" acronym="VIM_INTPRIORITY_136" offset="0x1220" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_137" acronym="VIM_INTPRIORITY_137" offset="0x1224" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_138" acronym="VIM_INTPRIORITY_138" offset="0x1228" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_139" acronym="VIM_INTPRIORITY_139" offset="0x122C" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_140" acronym="VIM_INTPRIORITY_140" offset="0x1230" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_141" acronym="VIM_INTPRIORITY_141" offset="0x1234" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_142" acronym="VIM_INTPRIORITY_142" offset="0x1238" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
