IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/VIM_VIM.xml
	<register id="VIM_INTPRIORITY_154" acronym="VIM_INTPRIORITY_154" offset="0x1268" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_155" acronym="VIM_INTPRIORITY_155" offset="0x126C" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_156" acronym="VIM_INTPRIORITY_156" offset="0x1270" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_157" acronym="VIM_INTPRIORITY_157" offset="0x1274" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_158" acronym="VIM_INTPRIORITY_158" offset="0x1278" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_159" acronym="VIM_INTPRIORITY_159" offset="0x127C" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_160" acronym="VIM_INTPRIORITY_160" offset="0x1280" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_161" acronym="VIM_INTPRIORITY_161" offset="0x1284" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_162" acronym="VIM_INTPRIORITY_162" offset="0x1288" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_163" acronym="VIM_INTPRIORITY_163" offset="0x128C" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_164" acronym="VIM_INTPRIORITY_164" offset="0x1290" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_165" acronym="VIM_INTPRIORITY_165" offset="0x1294" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_166" acronym="VIM_INTPRIORITY_166" offset="0x1298" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_167" acronym="VIM_INTPRIORITY_167" offset="0x129C" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_168" acronym="VIM_INTPRIORITY_168" offset="0x12A0" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_169" acronym="VIM_INTPRIORITY_169" offset="0x12A4" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_170" acronym="VIM_INTPRIORITY_170" offset="0x12A8" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_171" acronym="VIM_INTPRIORITY_171" offset="0x12AC" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_172" acronym="VIM_INTPRIORITY_172" offset="0x12B0" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="VIM_INTPRIORITY_173" acronym="VIM_INTPRIORITY_173" offset="0x12B4" width="32" description="">
		<bitfield id="RES19" width="28" begin="31" end="4" resetval="0x0" description="RESERVE FIELD" range="31 - 4" rwaccess="RO"/> 
		<bitfield id="PRI" width="4" begin="3" end="0" resetval="0x15" description="This is the priority for interrupt Q.  If two interrupts have the same priority, then whichever interrupt has the lower number Q wins arbitration  0  Highest Priority  15  Lowest Priority (Default)" range="3 - 0" rwaccess="RW"/>
	</register>
