IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/VIM_VIM.xml
	<register id="VIM_INTVECTOR_145" acronym="VIM_INTVECTOR_145" offset="0x2244" width="32" description="">
		<bitfield id="ADDR" width="30" begin="31" end="2" resetval="0x0" description="This is the 32-bit Vector Address associated with interrupt Q.  It is the address that will be reflected in the IRQ Vector Address (Base Address + 0x18) or FIQ Vector Address (Base Address + 0x1C) and the VECADDR pin when interrupt Q is the active interrupt.Internally, these values are kept in a RAM.  The FIQ and IRQ state machines have priority access to this RAM.  Writes to this register will be piped internally, but further writes to the MMR interface may be stalled until this write has a chance to complete in the RAM.  The new Vector Address will not take effect until this write completes to the RAM.  In order to tell if this write has completed, software may read this register back.  That read will not be able to complete unless the write has landed.Reads to this register will stall the MMR interface until the read is able to be completed at the RAM." range="31 - 2" rwaccess="RW"/> 
		<bitfield id="RES20" width="2" begin="1" end="0" resetval="0x0" description="Reserved.  Read as 0.  The lower 2 bits of the 32-bit vector address are always 0.  Vector addresses must be 32-bit aligned." range="1 - 0" rwaccess="RO"/>
	</register>
	<register id="VIM_INTVECTOR_146" acronym="VIM_INTVECTOR_146" offset="0x2248" width="32" description="">
		<bitfield id="ADDR" width="30" begin="31" end="2" resetval="0x0" description="This is the 32-bit Vector Address associated with interrupt Q.  It is the address that will be reflected in the IRQ Vector Address (Base Address + 0x18) or FIQ Vector Address (Base Address + 0x1C) and the VECADDR pin when interrupt Q is the active interrupt.Internally, these values are kept in a RAM.  The FIQ and IRQ state machines have priority access to this RAM.  Writes to this register will be piped internally, but further writes to the MMR interface may be stalled until this write has a chance to complete in the RAM.  The new Vector Address will not take effect until this write completes to the RAM.  In order to tell if this write has completed, software may read this register back.  That read will not be able to complete unless the write has landed.Reads to this register will stall the MMR interface until the read is able to be completed at the RAM." range="31 - 2" rwaccess="RW"/> 
		<bitfield id="RES20" width="2" begin="1" end="0" resetval="0x0" description="Reserved.  Read as 0.  The lower 2 bits of the 32-bit vector address are always 0.  Vector addresses must be 32-bit aligned." range="1 - 0" rwaccess="RO"/>
	</register>
	<register id="VIM_INTVECTOR_147" acronym="VIM_INTVECTOR_147" offset="0x224C" width="32" description="">
		<bitfield id="ADDR" width="30" begin="31" end="2" resetval="0x0" description="This is the 32-bit Vector Address associated with interrupt Q.  It is the address that will be reflected in the IRQ Vector Address (Base Address + 0x18) or FIQ Vector Address (Base Address + 0x1C) and the VECADDR pin when interrupt Q is the active interrupt.Internally, these values are kept in a RAM.  The FIQ and IRQ state machines have priority access to this RAM.  Writes to this register will be piped internally, but further writes to the MMR interface may be stalled until this write has a chance to complete in the RAM.  The new Vector Address will not take effect until this write completes to the RAM.  In order to tell if this write has completed, software may read this register back.  That read will not be able to complete unless the write has landed.Reads to this register will stall the MMR interface until the read is able to be completed at the RAM." range="31 - 2" rwaccess="RW"/> 
		<bitfield id="RES20" width="2" begin="1" end="0" resetval="0x0" description="Reserved.  Read as 0.  The lower 2 bits of the 32-bit vector address are always 0.  Vector addresses must be 32-bit aligned." range="1 - 0" rwaccess="RO"/>
	</register>
	<register id="VIM_INTVECTOR_148" acronym="VIM_INTVECTOR_148" offset="0x2250" width="32" description="">
		<bitfield id="ADDR" width="30" begin="31" end="2" resetval="0x0" description="This is the 32-bit Vector Address associated with interrupt Q.  It is the address that will be reflected in the IRQ Vector Address (Base Address + 0x18) or FIQ Vector Address (Base Address + 0x1C) and the VECADDR pin when interrupt Q is the active interrupt.Internally, these values are kept in a RAM.  The FIQ and IRQ state machines have priority access to this RAM.  Writes to this register will be piped internally, but further writes to the MMR interface may be stalled until this write has a chance to complete in the RAM.  The new Vector Address will not take effect until this write completes to the RAM.  In order to tell if this write has completed, software may read this register back.  That read will not be able to complete unless the write has landed.Reads to this register will stall the MMR interface until the read is able to be completed at the RAM." range="31 - 2" rwaccess="RW"/> 
		<bitfield id="RES20" width="2" begin="1" end="0" resetval="0x0" description="Reserved.  Read as 0.  The lower 2 bits of the 32-bit vector address are always 0.  Vector addresses must be 32-bit aligned." range="1 - 0" rwaccess="RO"/>
	</register>
	<register id="VIM_INTVECTOR_149" acronym="VIM_INTVECTOR_149" offset="0x2254" width="32" description="">
		<bitfield id="ADDR" width="30" begin="31" end="2" resetval="0x0" description="This is the 32-bit Vector Address associated with interrupt Q.  It is the address that will be reflected in the IRQ Vector Address (Base Address + 0x18) or FIQ Vector Address (Base Address + 0x1C) and the VECADDR pin when interrupt Q is the active interrupt.Internally, these values are kept in a RAM.  The FIQ and IRQ state machines have priority access to this RAM.  Writes to this register will be piped internally, but further writes to the MMR interface may be stalled until this write has a chance to complete in the RAM.  The new Vector Address will not take effect until this write completes to the RAM.  In order to tell if this write has completed, software may read this register back.  That read will not be able to complete unless the write has landed.Reads to this register will stall the MMR interface until the read is able to be completed at the RAM." range="31 - 2" rwaccess="RW"/> 
		<bitfield id="RES20" width="2" begin="1" end="0" resetval="0x0" description="Reserved.  Read as 0.  The lower 2 bits of the 32-bit vector address are always 0.  Vector addresses must be 32-bit aligned." range="1 - 0" rwaccess="RO"/>
	</register>
